package view;

public class MainManu {

	public static void showMainManu() {
		// 게임메뉴 화면
		System.out.println("==================================================");
		System.out.println("             🎵  MUSIC QUIZ GAME  🎵");
		System.out.println("==================================================");
		System.out.println("┌────────────────────────────────────────────────┐");
		System.out.println("│                 [ GAME  MENU ]                 │");
		System.out.println("├────────────────────────────────────────────────┤");
		System.out.println("│               1. ▶ GAME START                  │");
		System.out.println("│               2. ▶ RANKING                     │");
		System.out.println("│               3. ▶ HINT                        │");
		System.out.println("│               4. ▶ EXIT                        │");
		System.out.println("└────────────────────────────────────────────────┘");
		System.out.print("▶ 선택 : \n");
	}
	
	public static void showExitManu() {
		System.out.println("┌────────────────────────────────────────────────┐");
	    System.out.println("│                 [ EXIT  MENU ]                 │");
		System.out.println("├────────────────────────────────────────────────┤");
		System.out.println("│              1. 정말 종료하겠습니까?                │");
		System.out.println("│              2. 메뉴로 다시 돌아가기                │");
		System.out.println("└────────────────────────────────────────────────┘");
		System.out.print("▶ 선택 : \n");
	}
	
	public static void showExit() {
		System.out.println("          ███████╗ ██╗  ██╗ ██╗ ████████╗\r\n"
		                 + "          ██╔════╝ ╚██╗██╔╝ ██║ ╚══██╔══╝\r\n"
		                 + "          █████╗    ╚███╔╝  ██║    ██║\r\n"
		                 + "          ██╔══╝    ██╔██╗  ██║    ██║\r\n"
		                 + "          ███████╗ ██╔╝ ██╗ ██║    ██║\r\n"
		                 + "          ╚══════╝ ╚═╝  ╚═╝ ╚═╝    ╚═╝\r\n"
		                 + "             ♪ 음악 퀴즈를 종료합니다 ♪");
	}
	
	public static void showEndingManu() {
		System.out.println("┌────────────────────────────────────────────────┐");
	    System.out.println("│                 [ EXIT  MENU ]                 │");
		System.out.println("├────────────────────────────────────────────────┤");
		System.out.println("│                1. MAIN MENU                    │");
		System.out.println("│                2. EXIT                         │");
		System.out.println("└────────────────────────────────────────────────┘");
		System.out.print("▶ 선택 : ");
	}
	
}
