package view;

public class MainHint {
	
	public static void showHintIntro() {
		// 힌트 인트로
		System.out.println("                     .,,,.                         \r\n"
				+ "                   -;;=@@@*;;.                              \r\n"
				+ "                  $#@@@@@@@@@#*                             \r\n"
				+ "                ;@@@@@@@@@@@@@@$-                           \r\n"
				+ "               !@@@@@$;;;;;@@@@@@:                          \r\n"
				+ "              *@@@@*,.     ,~#@@@@:                         \r\n"
				+ "             ;@@@@*    .,     #@@@$.                        \r\n"
				+ "            .=@@@;   ;;$#~    .=@@@!                        \r\n"
				+ "            ,@@@!  .=@@@@@,    .#@@@                        \r\n"
				+ "            @@@$  .=@@@@@#,     .@@@$                       \r\n"
				+ "          . @@@;  !@@@$!;-       $@@$   .                   \r\n"
				+ "           *@@@   @@@#.          -@@#-                      \r\n"
				+ "           $@@@  !@@@.           ,@@@;                      \r\n"
				+ "           $@@@  $@@@            ,@@@;                      \r\n"
				+ "           $@@@  $@@@            ,@@@;                      \r\n"
				+ "           $@@@   $$,            ,@@@;                      \r\n"
				+ "           !@@@                  -@@#,                      \r\n"
				+ "            @@@=                 #@@$                       \r\n"
				+ "            #@@#.               ,@@@=                       \r\n"
				+ "            ~@@@!              ,#@@@.                       \r\n"
				+ "            .=@@@,             !@@@@                        \r\n"
				+ "             :@@@@~.         ,*@@@@@#.                      \r\n"
				+ "              :@@@@=;      .;#@@@@@@@=.                     \r\n"
				+ "               ~@@@@@$$$$$$#@@@@@@@@@@#                     \r\n"
				+ "                :#@@@@@@@@@@@@@@@@@@@@@#.                   \r\n"
				+ "                 -!#@@@@@@@@@$;=@@@@@@@@=.                  \r\n"
				+ "                   ,,=@@@@@!,. .$@@@@@@@@$                  \r\n"
				+ "                                 $@@@@@@@@#.                \r\n"
				+ "                                 .=@@@@@@@@*.               \r\n"
				+ "                                  .$@@@@@@@@,               \r\n"
				+ "                                    $@@@@@@@,               \r\n"
				+ "                                    .=@@@@@@,               \r\n"
				+ "                                     .#@@@@!                \r\n"
				+ "                                       $$$*    ");
	}
	
	public static void showHintManu() {
		// 힌트 메뉴
		System.out.println("┌────────────────────────────────────────────────┐");
	    System.out.println("│                 [ HINT  MENU ]                 │");
		System.out.println("├────────────────────────────────────────────────┤");
		System.out.println("│                 1. HINT EA                     │");
		System.out.println("│                 2. GAME MENU                   │");
		System.out.println("└────────────────────────────────────────────────┘");
		System.out.print("▶ 선택 : \n");
	}
	
	public static void showHintEa() {
		// 힌트 개수
		System.out.println("💡💡 힌트 개수 : 🔍🔍🔍🔍🔍🔍🔍🔍🔍🔍 💡💡");
	}
	
	public static void showHintUse() {
		System.out.println("==================================================");
	    System.out.println("              [ HINT 사용하시겠습니까? ]             ");
		System.out.println("==================================================");
		System.out.println("                 1. 🔍 사용                    ");
		System.out.println("                 2. 🔍 개수 확인                    ");
		System.out.println("                 3. 다음 문제                    ");
		System.out.println("==================================================");
		System.out.print("▶ 선택 : \n");
	}
}
